# -*- mode: org; -*-
#+TITLE: Aggregate Values in a Table
#+OPTIONS: ^:{} author:Thierry Banel toc:nil

Aggregating a table is creating a new table by computing sums,
averages, and so on, out of material from the frist table.

* Correlation of two columns

Some aggregations work on two columns (rather than one column for
=sum()=, =mean()=).
Those aggregations are =cov(,)=, =pcov(,)=, =corr(,)=.
- =corr(,)= computes the linear correlation between two columns.
- =cov(,)= and =pcov(,)= compute the covariance of two columns.

Example. We create a table where column =y= is a noisy version of
column =x=:

#+BEGIN_EXAMPLE
#+TBLNAME: noisydata
| bin   |  x |       y |
|-------+----+---------|
| small |  1 |  10.454 |
| small |  2 |  21.856 |
| small |  3 |  30.678 |
| small |  4 |  41.392 |
| small |  5 |  51.554 |
| large |  6 |  61.824 |
| large |  7 |  71.538 |
| large |  8 |  80.476 |
| large |  9 |  90.066 |
| large | 10 | 101.070 |
| large | 11 | 111.748 |
| large | 12 | 121.084 |
#+TBLFM: $3=$2*10+random(1000)/500;%.3f
#+END_EXAMPLE

#+BEGIN_EXAMPLE
#+BEGIN: aggregate :table noisydata :cols "bin corr(x,y) cov(x,y) pcov(x,y)"
| bin   |      corr(x,y) |      cov(x,y) |     pcov(x,y) |
|-------+----------------+---------------+---------------|
| small | 0.999459736649 |        25.434 |       20.3472 |
| large | 0.999542438688 | 46.4656666667 | 39.8277142857 |
#+END
#+END_EXAMPLE

We see that the correlation between =x= and =y= is very close to =1=,
meaning that both columns are correlated. Indeed they are, as the =y=
is computed from =x= with the formula =y = 10*x +
noise_between_0_and_2=.

* Additional formulas

A formula can be computed on top of an aggregation.  With a previous
example, adding a =:formula= parameter, we specify a new column =$4=
which uses aggregated columns.  It is translated into a usual =#+TBLFM:=
spreadsheet line.

#+BEGIN_EXAMPLE
#+BEGIN: aggregate :table original :cols "Day mean(Level) sum(Quantity)" :formula "$4=$2*$3"
| Day       | mean(Level) | sum(Quantity) |      |
|-----------+-------------+---------------+------|
| Monday    |        27.5 |            14 | 385. |
| Thuesday  |          43 |            45 | 1935 |
| Wednesday |          18 |            54 |  972 |
| Turdsday  |          43 |            83 | 3569 |
| Friday    |           8 |            22 |  176 |
#+TBLFM: $4=$2*$3
#+END_EXAMPLE

Moreover, if a =#+TBLFM:= was already there, it survives aggregation re-computations.

This happens in /pull mode/ only.

